UR_SDESK.ТелеграмБот/src/Catalogs/тг_Объект/тг_Объект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>тг_Объект</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.тг_ТипыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Чат</name>
    <type>
      <types>CatalogRef.тг_Объект</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.тг_Объект</types>
      </type>
    </attributes>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UR_SDESK.ТелеграмБот/src/Catalogs/тг_Объект/Forms/ФормаБота/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитыОбъекта = Справочники.тг_Объект.ПолучитьРеквизиты(Объект.Ссылка);
	
	РеквизитыОбъекта.Свойство("Токен"	, Токен);
	Если НЕ ПустаяСтрока(Токен) Тогда
		Вебхук = СтрЗаменить(тг_Сервер.ПолучитьВебхук(Токен),"/" + Объект.Код,"");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТокенПриИзменении(Элемент)
	ТокенПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВебхукПриИзменении(Элемент)
	ВебхукПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТокенПриИзмененииНаСервере()

	ДанныеБота = тг_Сервер.ПолучитьДанныеБота(Токен);
	РеквизитыОбъекта = Справочники.тг_Объект.ЗаполнитьРеквизиты(ДанныеБота);
	
	Если Не РеквизитыОбъекта.Свойство("Код",Объект.Код) Тогда
		Токен = "";
		Возврат;
	КонецЕсли;
	
	РеквизитыОбъекта.Свойство("Наименование", Объект.Наименование);
	
	Реквизиты = Объект.ДополнительныеРеквизиты;
	
	СтрокиТЧ = Реквизиты.НайтиСтроки(Новый Структура("Имя","Токен"));
	Если СтрокиТЧ.Количество() = 1 Тогда
		РеквизитТокен = СтрокиТЧ[0];
	Иначе
		РеквизитТокен = Реквизиты.Добавить();
		РеквизитТокен.Имя = "Токен";
	КонецЕсли;
	
	РеквизитТокен.Строка = Токен;
	
	Вебхук = тг_Сервер.ПолучитьВебхук(Токен);
			
КонецПроцедуры

&НаСервере
Процедура ВебхукПриИзмененииНаСервере()
	тг_Сервер.СохранитьВебхук(Токен, Вебхук + "/" + Объект.Код);
КонецПроцедуры

#КонецОбласти
